Revit 2024 API
BuiltInFailures.FabricAreaFailures Class
 Failures related to fabric area elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class FabricAreaFailures
Visual Basic
Public NotInheritable Class FabricAreaFailures
Visual C++
public ref class FabricAreaFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.FabricAreaFailures
See Also
BuiltInFailures.FabricAreaFailures Members
Autodesk.Revit.DB Namespace